In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('sample/sample.csv')

In [3]:
df.head()

   no     name  age
0   1     taro   25
1   2      ken   28
2   3    akari   13
3   4  takeshi   56
4   5     jiro   75

In [4]:
len(df)

10

In [5]:
df.shape

(10, 3)

In [6]:
df.columns

Index(['no', 'name', 'age'], dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   no      10 non-null     int64
 1   name    10 non-null     object
 2   age     10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 368.0+ bytes

In [8]:
df.describe()

             no        age
count  10.00000  10.000000
mean    5.50000  39.800000
std     3.02765  24.266117
min     1.00000  13.000000
25%     3.25000  25.250000
50%     5.50000  30.500000
75%     7.75000  53.500000
max    10.00000  82.000000

In [9]:
df.describe(include='all')

              no  name        age
count   10.00000    10  10.000000
unique       NaN    10        NaN
top          NaN  taro        NaN
freq         NaN     1        NaN
mean     5.50000   NaN  39.800000
std      3.02765   NaN  24.266117
min      1.00000   NaN  13.000000
25%      3.25000   NaN  25.250000
50%      5.50000   NaN  30.500000
75%      7.75000   NaN  53.500000
max     10.00000   NaN  82.000000

In [10]:
df.value_counts()

no  name      age
1   taro      25     1
2   ken       28     1
3   akari     13     1
4   takeshi   56     1
5   jiro      75     1
6   satoru    33     1
7   haru      26     1
8   korosuke  14     1
9   meme      82     1
10  saori     46     1
dtype: int64

In [11]:
df2 = pd.read_csv('../sample/sample2.csv')
df2.head()

   no  gender prefecture
0   1    male        東京都
1   2    male       神奈川県
2   3  female        北海道
3   4    male        静岡県
4   5    male        東京都

In [12]:
df2['gender'].value_counts()

male      6
female    4
Name: gender, dtype: int64

In [13]:
df_new = pd.merge(df, df2, on='no', how='left')
df_new

   no      name  age  gender prefecture
0   1      taro   25    male        東京都
1   2       ken   28    male       神奈川県
2   3     akari   13  female        北海道
3   4   takeshi   56    male        静岡県
4   5      jiro   75    male        東京都
5   6    satoru   33    male        岩手県
6   7      haru   26  female        新潟県
7   8  korosuke   14    male       神奈川県
8   9      meme   82  female        青森県
9  10     saori   46  female        熊本県